notrynohigh/ble_bridge_nrf52832/examples/ble_central/ble_app_uart_c/main.c
/**@brief Function for initializing the nrf log module. */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing the Power manager. */
static void power_init(void)
{
    ret_code_t err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initializing the Database Discovery Module. */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief uart send/rec functions
 */

void uart_send_string(uint8_t *pstr)
{
    if(pstr != NULL)
    {
        while(*pstr != '\0')
        {
            app_uart_put(*pstr);
            pstr++;
        }
    }
}

void uart_send_buff(uint8_t *pbuf, uint16_t len)
{
    uint16_t i = 0;
    if(pbuf == NULL)
    {
        return;
    }
    for(i = 0;i < len;i++)
    {
        app_uart_put(pbuf[i]);
    }
}

uint16_t uart_rec_buff(uint8_t *pbuf, uint16_t len)
{
    uint16_t i = 0;
    if(pbuf == NULL)
    {
        return 0;
    }
    for(i = 0;i < len;i++)
    {
        if(NRF_ERROR_NOT_FOUND == app_uart_get(pbuf))
        {
            break;
        }
        pbuf++;
    }
    return i;
}



/**
 * @brief loop timer
 */
APP_TIMER_DEF(utimer_20ms_id);
#define UART_RX_LEN         256
static uint8_t urx_table[UART_RX_LEN];
static void _timer_20ms_handler(void *parg)
{
    uint16_t len = 0;
    static uint16_t s_len = 0;
    len = uart_rec_buff(&urx_table[s_len], UART_RX_LEN - s_len);
    if(len > 0)
    {
        s_len += len;
    }
    else 
    {
        b_tp_receive_data(urx_table, s_len);
        s_len = 0;
    }
}

static void user_timer_init()
{
	uint32_t err_code;
    err_code = app_timer_create(&utimer_20ms_id, APP_TIMER_MODE_REPEATED, _timer_20ms_handler);
    APP_ERROR_CHECK(err_code);
}

#define UTIMER_20MS_INTERVAL    APP_TIMER_TICKS(20)
static void user_timer_start()
{
	uint32_t err_code;
    err_code = app_timer_start(utimer_20ms_id, UTIMER_20MS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/** timer end */

/**
 * @proto
 */
void b_tp_callback(b_TPU8 *pbuf, b_TPU32 len)
{
    uart_send_buff(pbuf, len);
}

int main(void)
{
    log_init();
    timer_init();
    power_init();
    uart_init();
    user_timer_init();
    b_tp_reg_callback(b_tp_callback);
    buttons_leds_init();
    db_discovery_init();
    ble_stack_init();
    gatt_init();
    nus_c_init();
    
    // Start scanning for peripherals and initiate connection
    // with devices that advertise NUS UUID.
    printf("BLE UART central example started.\r\n");
    NRF_LOG_INFO("BLE UART central example started.");
    scan_start();
    user_timer_start();
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            nrf_pwr_mgmt_run();
        }
    }
}
